k6-testing/results/04_http_503_hybrid.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6-testing/scripts/test-failure.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 50 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 50 VUs  0m00.7s/1m0s

running (0m02.0s), 50/50 VUs, 21 complete and 0 interrupted iterations
default   [   3% ] 50 VUs  0m01.7s/1m0s

running (0m03.0s), 50/50 VUs, 330 complete and 0 interrupted iterations
default   [   5% ] 50 VUs  0m02.7s/1m0s

running (0m04.0s), 50/50 VUs, 678 complete and 0 interrupted iterations
default   [   6% ] 50 VUs  0m03.7s/1m0s

running (0m05.0s), 50/50 VUs, 1050 complete and 0 interrupted iterations
default   [   8% ] 50 VUs  0m04.7s/1m0s

running (0m06.0s), 50/50 VUs, 1566 complete and 0 interrupted iterations
default   [  10% ] 50 VUs  0m05.7s/1m0s

running (0m07.0s), 50/50 VUs, 1935 complete and 0 interrupted iterations
default   [  11% ] 50 VUs  0m06.7s/1m0s

running (0m08.0s), 50/50 VUs, 2380 complete and 0 interrupted iterations
default   [  13% ] 50 VUs  0m07.7s/1m0s

running (0m09.0s), 50/50 VUs, 2983 complete and 0 interrupted iterations
default   [  15% ] 50 VUs  0m08.7s/1m0s

running (0m10.0s), 50/50 VUs, 3502 complete and 0 interrupted iterations
default   [  16% ] 50 VUs  0m09.7s/1m0s

running (0m11.0s), 50/50 VUs, 4147 complete and 0 interrupted iterations
default   [  18% ] 50 VUs  0m10.7s/1m0s

running (0m12.0s), 50/50 VUs, 4796 complete and 0 interrupted iterations
default   [  20% ] 50 VUs  0m11.7s/1m0s

running (0m13.0s), 50/50 VUs, 5451 complete and 0 interrupted iterations
default   [  21% ] 50 VUs  0m12.7s/1m0s

running (0m14.0s), 50/50 VUs, 6118 complete and 0 interrupted iterations
default   [  23% ] 50 VUs  0m13.7s/1m0s

running (0m15.0s), 50/50 VUs, 6849 complete and 0 interrupted iterations
default   [  25% ] 50 VUs  0m14.7s/1m0s

running (0m16.0s), 50/50 VUs, 7716 complete and 0 interrupted iterations
default   [  26% ] 50 VUs  0m15.7s/1m0s

running (0m17.0s), 50/50 VUs, 8715 complete and 0 interrupted iterations
default   [  28% ] 50 VUs  0m16.7s/1m0s

running (0m18.0s), 50/50 VUs, 9795 complete and 0 interrupted iterations
default   [  30% ] 50 VUs  0m17.7s/1m0s

running (0m19.0s), 50/50 VUs, 10684 complete and 0 interrupted iterations
default   [  31% ] 50 VUs  0m18.7s/1m0s

running (0m20.0s), 50/50 VUs, 11717 complete and 0 interrupted iterations
default   [  33% ] 50 VUs  0m19.7s/1m0s

running (0m21.0s), 50/50 VUs, 12772 complete and 0 interrupted iterations
default   [  35% ] 50 VUs  0m20.7s/1m0s

running (0m22.0s), 50/50 VUs, 14244 complete and 0 interrupted iterations
default   [  36% ] 50 VUs  0m21.7s/1m0s

running (0m23.0s), 50/50 VUs, 15943 complete and 0 interrupted iterations
default   [  38% ] 50 VUs  0m22.7s/1m0s

running (0m24.0s), 50/50 VUs, 17510 complete and 0 interrupted iterations
default   [  40% ] 50 VUs  0m23.7s/1m0s

running (0m25.0s), 50/50 VUs, 18996 complete and 0 interrupted iterations
default   [  41% ] 50 VUs  0m24.7s/1m0s

running (0m26.0s), 50/50 VUs, 20569 complete and 0 interrupted iterations
default   [  43% ] 50 VUs  0m25.7s/1m0s

running (0m27.0s), 50/50 VUs, 23207 complete and 0 interrupted iterations
default   [  45% ] 50 VUs  0m26.7s/1m0s

running (0m28.0s), 50/50 VUs, 26247 complete and 0 interrupted iterations
default   [  46% ] 50 VUs  0m27.7s/1m0s

running (0m29.0s), 50/50 VUs, 29392 complete and 0 interrupted iterations
default   [  48% ] 50 VUs  0m28.7s/1m0s

running (0m30.0s), 50/50 VUs, 32358 complete and 0 interrupted iterations
default   [  50% ] 50 VUs  0m29.7s/1m0s

running (0m31.0s), 50/50 VUs, 35454 complete and 0 interrupted iterations
default   [  51% ] 50 VUs  0m30.7s/1m0s

running (0m32.0s), 50/50 VUs, 38848 complete and 0 interrupted iterations
default   [  53% ] 50 VUs  0m31.7s/1m0s

running (0m33.0s), 50/50 VUs, 42177 complete and 0 interrupted iterations
default   [  55% ] 50 VUs  0m32.7s/1m0s

running (0m34.0s), 50/50 VUs, 45464 complete and 0 interrupted iterations
default   [  56% ] 50 VUs  0m33.7s/1m0s

running (0m35.0s), 50/50 VUs, 48837 complete and 0 interrupted iterations
default   [  58% ] 50 VUs  0m34.7s/1m0s

running (0m36.0s), 50/50 VUs, 51264 complete and 0 interrupted iterations
default   [  60% ] 50 VUs  0m35.7s/1m0s

running (0m37.0s), 50/50 VUs, 53540 complete and 0 interrupted iterations
default   [  61% ] 50 VUs  0m36.7s/1m0s

running (0m38.0s), 50/50 VUs, 55508 complete and 0 interrupted iterations
default   [  63% ] 50 VUs  0m37.7s/1m0s

running (0m39.0s), 50/50 VUs, 57756 complete and 0 interrupted iterations
default   [  65% ] 50 VUs  0m38.7s/1m0s

running (0m40.0s), 50/50 VUs, 59549 complete and 0 interrupted iterations
default   [  66% ] 50 VUs  0m39.7s/1m0s

running (0m41.0s), 50/50 VUs, 61213 complete and 0 interrupted iterations
default   [  68% ] 50 VUs  0m40.7s/1m0s

running (0m42.0s), 50/50 VUs, 63003 complete and 0 interrupted iterations
default   [  70% ] 50 VUs  0m41.7s/1m0s

running (0m43.0s), 50/50 VUs, 64607 complete and 0 interrupted iterations
default   [  71% ] 50 VUs  0m42.7s/1m0s

running (0m44.0s), 50/50 VUs, 66281 complete and 0 interrupted iterations
default   [  73% ] 50 VUs  0m43.7s/1m0s

running (0m45.0s), 50/50 VUs, 67699 complete and 0 interrupted iterations
default   [  75% ] 50 VUs  0m44.7s/1m0s

running (0m46.0s), 50/50 VUs, 68849 complete and 0 interrupted iterations
default   [  76% ] 50 VUs  0m45.7s/1m0s

running (0m47.0s), 50/50 VUs, 70377 complete and 0 interrupted iterations
default   [  78% ] 50 VUs  0m46.7s/1m0s

running (0m48.0s), 50/50 VUs, 72125 complete and 0 interrupted iterations
default   [  80% ] 50 VUs  0m47.7s/1m0s

running (0m49.0s), 50/50 VUs, 73540 complete and 0 interrupted iterations
default   [  81% ] 50 VUs  0m48.7s/1m0s

running (0m50.0s), 50/50 VUs, 74926 complete and 0 interrupted iterations
default   [  83% ] 50 VUs  0m49.7s/1m0s

running (0m51.0s), 50/50 VUs, 76460 complete and 0 interrupted iterations
default   [  85% ] 50 VUs  0m50.7s/1m0s

running (0m52.0s), 50/50 VUs, 78379 complete and 0 interrupted iterations
default   [  86% ] 50 VUs  0m51.7s/1m0s

running (0m53.0s), 50/50 VUs, 80132 complete and 0 interrupted iterations
default   [  88% ] 50 VUs  0m52.7s/1m0s

running (0m54.0s), 50/50 VUs, 81921 complete and 0 interrupted iterations
default   [  90% ] 50 VUs  0m53.7s/1m0s

running (0m55.0s), 50/50 VUs, 83777 complete and 0 interrupted iterations
default   [  91% ] 50 VUs  0m54.7s/1m0s

running (0m56.0s), 50/50 VUs, 85343 complete and 0 interrupted iterations
default   [  93% ] 50 VUs  0m55.7s/1m0s

running (0m57.0s), 50/50 VUs, 86937 complete and 0 interrupted iterations
default   [  95% ] 50 VUs  0m56.7s/1m0s

running (0m58.0s), 50/50 VUs, 88784 complete and 0 interrupted iterations
default   [  96% ] 50 VUs  0m57.7s/1m0s

running (0m59.0s), 50/50 VUs, 90604 complete and 0 interrupted iterations
default   [  98% ] 50 VUs  0m58.7s/1m0s

running (1m00.0s), 50/50 VUs, 92351 complete and 0 interrupted iterations
default   [ 100% ] 50 VUs  0m59.7s/1m0s


  █ TOTAL RESULTS 

    checks_total.......: 92864   1540.010966/s
    checks_succeeded...: 0.00%   0 out of 92864
    checks_failed......: 100.00% 92864 out of 92864

    ✗ is status 200
      ↳  0% — ✓ 0 / ✗ 92864

    HTTP
    http_req_duration..............: avg=32.15ms min=4.02ms med=21.85ms  max=1.82s    p(90)=61.77ms  p(95)=83.62ms 
      { expected_response:true }...: avg=94.22ms min=4.02ms med=115.89ms max=162.74ms p(90)=153.37ms p(95)=158.06ms
    http_req_failed................: 99.99% 92864 out of 92867
    http_reqs......................: 92867  1540.060717/s

    EXECUTION
    iteration_duration.............: avg=32.29ms min=4.71ms med=21.98ms  max=1.82s    p(90)=61.96ms  p(95)=83.78ms 
    iterations.....................: 92864  1540.010966/s
    vus............................: 50     min=50             max=50
    vus_max........................: 50     min=50             max=50

    NETWORK
    data_received..................: 24 MB  398 kB/s
    data_sent......................: 9.6 MB 159 kB/s



running (1m00.3s), 00/50 VUs, 92864 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  1m0s